[
  {
    "chunk_id": "c0",
    "text": "The Earth is round. Scientists have definitively proven that the Earth is a sphere. Our planet orbits the Sun in an elliptical path. However, some flat Earth believers claim the Earth is flat. They argue that gravity is a hoax. The flat Earth theory contradicts all modern evidence.",
    "start_char": 1,
    "end_char": 284,
    "embedding_id": "e0"
  },
  {
    "chunk_id": "c1",
    "text": "Exercise is beneficial for health. Regular physical activity improves cardiovascular function. Studies show that active people live longer. Exercise prevents many diseases. But some extremists insist that exercise is harmful and causes injury.",
    "start_char": 286,
    "end_char": 530,
    "embedding_id": "e1"
  },
  {
    "chunk_id": "c2",
    "text": "On the other hand, sedentary behavior is healthier than exercise. Sitting all day is better for your muscles than physical activity. Climate change is real and caused by human activity. Global temperatures are rising due to\ngreenhouse gas emissions. Scientists agree on this.",
    "start_char": 531,
    "end_char": 807,
    "embedding_id": "e2"
  },
  {
    "chunk_id": "c3",
    "text": "Scientists agree on this. Conversely, climate skeptics claim climate change is a hoax. The Earth's climate is stable and not affected by humans. Water boils at 100 degrees Celsius at sea level. This is a fundamental fact taught in every\nscience class.",
    "start_char": 782,
    "end_char": 1035,
    "embedding_id": "e3"
  },
  {
    "chunk_id": "c4",
    "text": "Yet some pseudoscience advocates insist water boils at 50 degrees Celsius. Vaccines are safe and effective. Millions of people have received vaccines without severe\nside effects. Vaccination prevents diseases. In contrast, anti-vaccine activists claim vaccines cause autism and severe injuries.",
    "start_char": 1037,
    "end_char": 1333,
    "embedding_id": "e4"
  },
  {
    "chunk_id": "c5",
    "text": "They are dangerous and should be avoided. Vaccination makes people sick.",
    "start_char": 1334,
    "end_char": 1406,
    "embedding_id": "e5"
  }
]